# IsSectionBoxActive Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..IsSectionBoxActive Property
View3D Class Example See Also
---
Identifies whether or not the section box is active in this 3D view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsSectionBoxActive { get; set; }
```

Visual Basic
---
```text
Public Property IsSectionBoxActive As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsSectionBoxActive {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
An active section box clips the geometry of the model in the 3D view. This affects the appearance of the view, and also will affect information returned from the API. For example:
  * Elements outside the active section box will not be returned in the list of elements obtained from [!:Autodesk::Revit::DB::FilteredElementCollector] when this view is passed when contructing the collector.
  * Elements clipped by the active section box will return clipped geometry from [Geometry[([( Options])]) ](d8a55a5b-2a69-d5ab-3e1f-6cf1ee43c8ec.md "Geometry Property") when this view is included in the options.

# Examples
CopyC#
```text
private void DisableSectionBox(View3D view3d)
{
    if (!view3d.IsSectionBoxActive)
    {
        TaskDialog.Show("Revit", "The section box for View3D isn't active.");
        return;
    }

    // Disable the section box (requires an open transaction)
    view3d.IsSectionBoxActive = false;
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Returns true if the view is not a view template. |

# See Also
View3D Class
Autodesk.Revit.DB Namespace